###
## Taking Transpose:
###

In [4]:
import pandas as pd

a = pd.read_csv('name,age,gender.csv')
b= a.T # it will convert 1st row into 1st column,2nd row into 2nd column
a
b

           0         1         2       3
Name     Ali  Mohammed  Jennifer  Rayyan
Age       20        19        21      19
Gender  Male      Male    Female    Male

In [5]:
a.size,b.size

(12, 12)

###
## Adding Column Name:
###

In [8]:

import pandas as pd

a = [['One',1],['Two',2],['Three',3]]
b = pd.DataFrame(a, columns = ['String','Numbers'])
b
b.T

           0    1      2
String   One  Two  Three
Numbers    1    2      3

###
## Sets:
###

In [9]:

import pandas as pd

a = (('One',1),('Two',2),('Three',3))
b = pd.DataFrame(a, columns = ['String','Numbers'])
b.T
b

  String  Numbers
0    One        1
1    Two        2
2  Three        3

###
## nan:
###

In [10]:


import pandas as pd
import numpy as np

a = [['One',1],['Two'],[np.nan,3],[None,4]]
b = pd.DataFrame(a, columns = ['Strings','Numbers'])
b

  Strings  Numbers
0     One      1.0
1     Two      NaN
2     NaN      3.0
3    None      4.0

In [11]:
# adding column name

import pandas as pd

a = [['One',1],['Two',2],['Three',3]]
b = pd.DataFrame(a)
b

c = pd.DataFrame(a, columns = ['string','Integers'])
c

  string  Integers
0    One         1
1    Two         2
2  Three         3